fix: the final read me
